export const six = ['能天使', '推进之王', '伊芙利特', '艾雅法拉', '安洁莉娜', '闪灵', '夜莺', '星熊', '塞雷娅', '银灰', '斯卡蒂', '陈', '黑', '赫拉格', '麦哲伦', '莫斯提马', '煌', '阿', '刻俄柏', '风笛', '傀影', '温蒂', '早露', '铃兰', '棘刺', '森蚺', '史尔特尔', '瑕光', '泥岩', '山', '空弦', '嵯峨', '异客', '凯尔希', '卡涅利安', '帕拉斯', '水月', '琴柳', '远牙', '焰尾'];

export const five = ['白面鸮', '凛冬', '德克萨斯', '芙兰卡', '拉普兰德', '幽灵鲨', '蓝毒', '白金', '陨星', '天火', '梅尔', '赫默', '华法琳', '临光', '红', '雷蛇', '可颂', '普罗旺斯', '守林人', '崖心', '初雪', '真理', '空', '狮蝎', '食铁兽', '夜魔', '诗怀雅', '格劳克斯', '星极', '送葬人', '槐琥', '苇草', '布洛卡', '灰喉', '吽', '惊蛰', '慑砂', '巫恋', '极境', '月禾', '石棉', '莱恩哈特', '蜜蜡', '贾维', '安哲拉', '燧石', '四月', '奥斯塔', '絮雨', '卡夫卡', '爱丽丝', '乌有', '熔泉', '赤东', '绮良', '羽毛笔', '桑葚', '灰毫', '蚀清'];

export const four = ['夜烟', '远山', '杰西卡', '流星', '白雪', '清道夫', '红豆', '杜宾', '缠丸', '霜叶', '慕斯', '砾', '暗索', '末药', '调香师', '角峰', '蛇屠箱', '古米', '深海色', '地灵', '阿消', '猎蜂', '格雷伊', '苏苏洛', '桃金娘', '红云', '梅', '安比尔', '宴', '刻刀', '波登可', '卡达', '孑', '酸糖', '芳汀', '泡泡', '杰克', '松果', '豆苗', '深靛', '罗比菈塔'];

export const three = ['芬', '香草', '翎羽', '玫兰莎', '卡缇', '米格鲁', '克洛丝', '炎熔', '芙蓉', '安塞尔', '史都华德', '梓兰', '空爆', '月见夜', '斑点', '泡普卡'];


export const packagePacks: PackagesPackData = {
    name: ['每月寻访礼包 (源石*42, 10连凭证*1)', '新人寻访组合包 (10连凭证*2)', '感谢庆典备战包 (源石*90, 10连凭证*1)', '月卡 (6源石+每天200合成玉)', '观光礼包 (10连凭证*2, 补发24合成玉)'],
    price: [168, 128, 328, 30, 198],
    jade: [6000, 12000, 6000, 6000, 12000],
    originiums: [42, 0, 90, 6, 24]
};

export const originiumsPacks: OriginiumsPackData = {
    count: [1, 7, 24, 50, 90, 185],    // 源石礼包中的源石数
    price: [6, 30, 98, 198, 328, 648], // 源石礼包价格
    extra: [3, 12, 40, 80, 132, 260]   // 首充源石礼包送的源石
};


export const noactdata: PoolData = {
    six: six,
    five: five,
    four: four,
    three: three,
    name: '无up卡池',
    prob6: 0,
    prob5: 0,
    prob4: 0,
    prob3: 0,
    floor: [],
    probfloorcount: 0

}

const act0data: PoolData = {
    six: ['琴柳', '阿'],
    five: ['羽毛笔', '普罗旺斯', '吽'],
    four: [],
    three: [],
    name: '常驻标准寻访',
    prob6: 50,
    prob5: 50,
    prob4: 0,
    prob3: 0,
    floor: [], // 限定复刻机制
    probfloorcount: 0 // 彩六120保底机制
};

const act1data: PoolData = { // 活动池
    six: ['澄闪'],
    five: ['天火', '夏栎'],
    four: [],
    three: [],
    name: '火花绽放',
    prob6: 50,
    prob5: 50,
    prob4: 0,
    prob3: 0,
    floor: [],
    probfloorcount: 0
};

const act2data: PoolData = {
    six: ['令','老鲤'],
    five: ['夜半'],
    four: [],
    three: [],
    name: '浊酒澄心',
    prob6: 70,
    prob5: 50,
    prob4: 0,
    prob3: 0,
    floor: ['年', '夕'],
    probfloorcount: 0
};


export const actList: PoolData[] = [act0data, act1data, act2data];
